[
  {
    "title": "ഈ വള്ളിയിൽ നിന്നു ചെമ്മേ പൂക്കൾ 🌸 Full Version | Malayalam Kids Poem",
    "slug": "ee-valliyil-ninnu-chemme-pokkal",
    "yt_id": "SJNgDB9vn1o",
    "published": "2025-11-02",
    "duration": "PT2M52S",
    "lang": "ml",
    "categories": [
      "Poem",
      "Nature",
      "Folk"
    ],
    "description_short": "Full-length Malayalam kids poem celebrating berry vines, playful cousins, and harvest joy.",
    "description_long": "Ee Valliyil Ninnu Chemme Pokkal returns as a full-length countryside musical that follows cousins weaving garlands beside the village backwaters. Every new verse lingers on the berry vine, coconut groves, and moonlit courtyards while layered chenda, thavil, and bamboo flute arrangements guide clapping patterns. Gentle narration teaches fresh Malayalam nature words, counting games, and mindful breathing as the children share the harvest with grandparents. Families can pause to discuss seasonal produce, kindness, and sustainable farming before the finale’s festive parade of lanterns and marigold scarves.",
    "tags": [
      "malayalam kids song",
      "malayalam kids poem",
      "malayalam rhymes for babies",
      "malayalam folk dance",
      "cartoon song malayalam short",
      "malayalam action song for kg students",
      "lkg nursery rhyme malayalam",
      "kerala kids rhyme",
      "ambambo kili",
      "malayalam harvest song"
    ],
    "thumb_url": "https://img.youtube.com/vi/SJNgDB9vn1o/maxresdefault.jpg",
    "playlist_urls": [
      "https://www.youtube.com/watch?v=SJNgDB9vn1o"
    ],
    "lyrics": [
      "ഈ വള്ളിയിൽ നിന്നു ചെമ്മേ പൂക്കൾ\nആ വള്ളിയിൽ നിന്നു വെള്ള പൂക്കൾ\nഎനിക്കൊരു മാല അണിയാൻ വേണം\nമുത്തശ്ശീ മുത്തശ്ശീ തരാമോ പൂക്കൾ",
      "ഈ പുഴയിൽ നിന്നു ചെമ്മേ മീനുകൾ\nആ പുഴയിൽ നിന്നു വെള്ള മീനുകൾ\nഎനിക്കൊരു കറി ഉണ്ടാക്കാൻ വേണം\nമുത്തശ്ശീ മുത്തശ്ശീ തരാമോ മീനുകൾ",
      "ഈ തോപ്പിൽ നിന്നു ചെമ്മേ മാമ്പഴം\nആ തോപ്പിൽ നിന്നു വെള്ള മാമ്പഴം\nഎനിക്കൊരു പായസം പാകം ചെയ്യണം\nമുത്തശ്ശീ മുത്തശ്ശീ തരാമോ മാമ്പഴം"
    ],
    "end_screen_suggestions": [
      {
        "title": "Pachakkari Song",
        "slug": "pachakkari-song"
      },
      {
        "title": "Kaattile Koottukar",
        "slug": "kaattile-koottukar"
      }
    ]
  },
  {
    "title": "Ambiliyammavaa | Full Moon Lullaby Malayalam Cartoon",
    "slug": "ambiliyammavaa",
    "yt_id": "Q7XSyvbV-q0",
    "published": "2025-01-12",
    "duration": "PT4M12S",
    "lang": "ml",
    "categories": [
      "Lullaby",
      "Family",
      "Folk"
    ],
    "description_short": "A gentle lullaby about Ambili Amma and the moonlit courtyard of Kerala nights.",
    "description_long": "Ambiliyammavaa brings the timeless Kerala moonlight into every child’s room with a melodic lullaby that paints glowing pictures of the courtyard. As the cartoon siblings lie on woven mats, their grandmother tells stories of Ambili Amma rowing across the sky. The tune blends veena strings, soft mridangam taps, and whispery vocals that ease bedtime jitters. Visuals shimmer with coconut fronds swaying, fireflies humming, and the moon sprinkling silver sparkles over the backwater. Children learn new Malayalam vocabulary for the night sky, bedtime rituals, and family affection while following the siblings as they breathe slowly and snuggle under embroidered quilts. Teachers and parents can use the video to spark discussions about circadian rhythms, traditional lullabies, and respect for nature’s rhythms. The song ends with a quiet reprise that invites kids to whisper their wishes to Ambili Amma before drifting into dreams.",
    "tags": [
      "malayalam kids song",
      "malayalam rhymes for babies",
      "malayalam folk dance",
      "cartoon song malayalam short",
      "malayalam action song for kg students",
      "lkg nursery rhyme malayalam",
      "malayalam song school girl dance",
      "kerala kids rhyme",
      "ambambo kili",
      "malayalam animation 2025"
    ],
    "thumb_url": "https://img.youtube.com/vi/Q7XSyvbV-q0/maxresdefault.jpg",
    "playlist_urls": [
      "https://www.youtube.com/watch?v=Q7XSyvbV-q0"
    ],
    "end_screen_suggestions": [
      {
        "title": "Onnanam Kochu Thumbi",
        "slug": "onnanam-kochu-thumbi"
      },
      {
        "title": "Koo Koo Theevandi",
        "slug": "koo-koo-theevandi"
      }
    ]
  },
  {
    "title": "Onnanam Kochu Thumbi | Nature Dance Song",
    "slug": "onnanam-kochu-thumbi",
    "yt_id": "GfM0cftOJ3k",
    "published": "2025-02-05",
    "duration": "PT3M58S",
    "lang": "ml",
    "categories": [
      "Dance",
      "Animals",
      "Folk"
    ],
    "description_short": "Butterfly friends teach graceful Malayalam dance steps in a garden fiesta.",
    "description_long": "Onnanam Kochu Thumbi flutters through a rainbow garden where butterflies choreograph a Malayalam folk dance workshop. The cartoon cousins step into the clearing wearing kasavu skirts and kurta vests, ready to learn gestures inspired by petals, raindrops, and wind. Each verse introduces a butterfly mentor who demonstrates mudras and footwork linked to classical Kerala dance while the soundtrack pulses with chenda beats, bamboo flute runs, and modern bass drops. Children practice balancing, coordination, and descriptive Malayalam words for color, movement, and rhythm. The story celebrates environmental care as the cousins promise to plant more flowers for their insect friends. Teachers can pause the video to discuss pollination, metamorphosis, and the cultural heritage of folk dance troupes at school festivals. The finale invites viewers to twirl with their own scarves and record a family dance performance, turning the living room into a stage lit by evening fireflies.",
    "tags": [
      "malayalam kids song",
      "malayalam rhymes for babies",
      "malayalam folk dance",
      "cartoon song malayalam short",
      "malayalam action song for kg students",
      "lkg nursery rhyme malayalam",
      "malayalam song school girl dance",
      "kerala kids rhyme",
      "ambambo kili",
      "malayalam animation 2025"
    ],
    "thumb_url": "https://img.youtube.com/vi/GfM0cftOJ3k/maxresdefault.jpg",
    "playlist_urls": [
      "https://www.youtube.com/watch?v=GfM0cftOJ3k"
    ],
    "end_screen_suggestions": [
      {
        "title": "Pachakkari Song",
        "slug": "pachakkari-song"
      },
      {
        "title": "Kaattile Koottukar",
        "slug": "kaattile-koottukar"
      }
    ]
  },
  {
    "title": "Pacha Thatha Paattu | Grandpa’s Garden Adventure",
    "slug": "pacha-thatha-paattu",
    "yt_id": "HnE3hREUIoo",
    "published": "2025-03-18",
    "duration": "PT5M02S",
    "lang": "ml",
    "categories": [
      "Family",
      "Story",
      "Folk"
    ],
    "description_short": "Grandpa teaches herbal wisdom through a musical walk in the garden.",
    "description_long": "Pacha Thatha Paattu invites children to follow their grandpa through a vibrant Kerala herbal garden. Each stanza focuses on a fragrant plant – tulasi, vazha, muringa, and even the humble curry leaf – connecting its medicinal uses with lyrical Malayalam vocabulary. Grandpa’s playful riddles inspire the kids to touch, smell, and sing along, building curiosity about Ayurveda and ecology. The animation layers watercolor textures with hand-drawn chalk doodles, making the herbs glow under the tropical sun. Gentle percussion, ghatam beats, and acoustic guitar strums keep the rhythm comforting and upbeat. The narrative highlights values such as respecting elders, sharing chores, and conserving water using clay pots. Educators can use the video for science lessons about plant parts, nutrition, and mindfulness practices in daily routines. The story concludes with a kitchen jam session where the family cooks a green stew, reinforcing healthy eating habits through song.",
    "tags": [
      "malayalam kids song",
      "malayalam rhymes for babies",
      "malayalam folk dance",
      "cartoon song malayalam short",
      "malayalam action song for kg students",
      "lkg nursery rhyme malayalam",
      "malayalam song school girl dance",
      "kerala kids rhyme",
      "ambambo kili",
      "malayalam animation 2025"
    ],
    "thumb_url": "https://img.youtube.com/vi/HnE3hREUIoo/maxresdefault.jpg",
    "playlist_urls": [
      "https://www.youtube.com/watch?v=HnE3hREUIoo"
    ],
    "end_screen_suggestions": [
      {
        "title": "Veetumuttathe Praavukal",
        "slug": "veetumuttathe-praavukal"
      },
      {
        "title": "Baby Baby Karayalle",
        "slug": "baby-baby-karayalle"
      }
    ]
  },
  {
    "title": "Pachakkari Song | Vegetable Market Carnival",
    "slug": "pachakkari-song",
    "yt_id": "tCq9EGqlA3U",
    "published": "2025-04-10",
    "duration": "PT4M21S",
    "lang": "ml",
    "categories": [
      "Story",
      "Family",
      "Animals"
    ],
    "description_short": "A catchy market rhyme teaches Malayalam names of vegetables and helpful habits.",
    "description_long": "Pachakkari Song spins a carnival at the village market where children bargain with friendly vendors while parrots echo their Malayalam words. Every verse highlights a vegetable stall with animated drums of beans, sparkling tomatoes, and comical pumpkins. Kids learn counting, colors, and nutritional facts as the lyrics rhythmically weave in verbs for washing, chopping, and cooking. The upbeat tune fuses kuthu beats with jazzy trumpet riffs, making it irresistible for classroom warm-ups and school annual day performances. Scenes of reusable bags, composting baskets, and cooperative farming underline sustainability. A mid-song rap by a mischievous goat explains how fiber keeps tummies happy, bringing laughter to the chorus. The finale crowns young chefs who prepare a rainbow salad to share with elders, inspiring viewers to try new vegetables at home. Teachers can pair the video with drawing activities or role-play games about running an eco-friendly market.",
    "tags": [
      "malayalam kids song",
      "malayalam rhymes for babies",
      "malayalam folk dance",
      "cartoon song malayalam short",
      "malayalam action song for kg students",
      "lkg nursery rhyme malayalam",
      "malayalam song school girl dance",
      "kerala kids rhyme",
      "ambambo kili",
      "malayalam animation 2025"
    ],
    "thumb_url": "https://img.youtube.com/vi/tCq9EGqlA3U/maxresdefault.jpg",
    "playlist_urls": [
      "https://www.youtube.com/watch?v=tCq9EGqlA3U"
    ],
    "end_screen_suggestions": [
      {
        "title": "Dolphin Birthday Song",
        "slug": "dolphin-birthday-song"
      },
      {
        "title": "Koo Koo Theevandi",
        "slug": "koo-koo-theevandi"
      }
    ]
  },
  {
    "title": "Kaattile Koottukar | Forest Friends Adventure",
    "slug": "kaattile-koottukar",
    "yt_id": "DGVczRLH7pI",
    "published": "2025-05-02",
    "duration": "PT6M10S",
    "lang": "ml",
    "categories": [
      "Animals",
      "Story",
      "Folk"
    ],
    "description_short": "Children camp in a Kerala forest and learn empathy from animal friends.",
    "description_long": "Kaattile Koottukar sends children into the lush Western Ghats for a moonlit campout guided by a forest ranger aunty. Along the path they meet a playful langur, a shy mouse deer, and a melodious Malabar whistling thrush. Each animal shares a story about teamwork, patience, and caring for the environment, teaching vocabulary for habitats, sounds, and emotions. The animation blends 2D watercolor textures with subtle 3D lighting, making the fireflies and waterfalls sparkle. Layered percussion with bamboo chimes builds a gentle suspense that keeps viewers tuned in. The narrative encourages kids to respect quiet spaces, minimize plastic use, and observe wildlife from a distance. In the final chorus, the animals and children perform a coordinated folk dance, waving lanterns that form star patterns in the sky. This video doubles as a social-emotional learning resource that celebrates empathy, conservation, and Malayalam storytelling traditions.",
    "tags": [
      "malayalam kids song",
      "malayalam rhymes for babies",
      "malayalam folk dance",
      "cartoon song malayalam short",
      "malayalam action song for kg students",
      "lkg nursery rhyme malayalam",
      "malayalam song school girl dance",
      "kerala kids rhyme",
      "ambambo kili",
      "malayalam animation 2025"
    ],
    "thumb_url": "https://img.youtube.com/vi/DGVczRLH7pI/maxresdefault.jpg",
    "playlist_urls": [
      "https://www.youtube.com/watch?v=DGVczRLH7pI"
    ],
    "end_screen_suggestions": [
      {
        "title": "Pacha Thatha Paattu",
        "slug": "pacha-thatha-paattu"
      },
      {
        "title": "Koo Koo Theevandi",
        "slug": "koo-koo-theevandi"
      }
    ]
  },
  {
    "title": "Baby Baby Karayalle | Feelings Song for Toddlers",
    "slug": "baby-baby-karayalle",
    "yt_id": "PwLja9dkXzE",
    "published": "2025-06-14",
    "duration": "PT3M05S",
    "lang": "ml",
    "categories": [
      "Family",
      "Lullaby",
      "Story"
    ],
    "description_short": "A comforting tune helps toddlers name emotions and calm their minds.",
    "description_long": "Baby Baby Karayalle is the go-to feelings anthem for toddlers navigating big emotions. The animation features a toddler trio guided by a plush elephant who teaches breathing exercises in Malayalam. Each verse introduces a feeling – sadness, excitement, anger, and shyness – with gentle explanations and coping strategies. Parents appear with supportive dialogues, modeling how to acknowledge feelings without judgment. Soft ukulele plucks blend with ocean wave ambience to create a soothing bedtime vibe, while simple call-and-response lyrics invite participation. Visual cues such as glowing stars, color-changing lanterns, and floating hearts reinforce emotional vocabulary. The bridge segment transforms into a mini yoga flow with easy stretches ideal for LKG classrooms. Educators can pair the video with emotional check-in charts or puppet shows. The final chorus reassures kids that every feeling finds comfort in a caring family hug, leaving viewers peaceful and sleepy.",
    "tags": [
      "malayalam kids song",
      "malayalam rhymes for babies",
      "malayalam folk dance",
      "cartoon song malayalam short",
      "malayalam action song for kg students",
      "lkg nursery rhyme malayalam",
      "malayalam song school girl dance",
      "kerala kids rhyme",
      "ambambo kili",
      "malayalam animation 2025"
    ],
    "thumb_url": "https://img.youtube.com/vi/PwLja9dkXzE/maxresdefault.jpg",
    "playlist_urls": [
      "https://www.youtube.com/watch?v=PwLja9dkXzE"
    ],
    "end_screen_suggestions": [
      {
        "title": "Ambiliyammavaa",
        "slug": "ambiliyammavaa"
      },
      {
        "title": "Kochu Nakshathrame",
        "slug": "kochu-nakshathrame"
      }
    ]
  },
  {
    "title": "Kochu Nakshathrame | Star Gazing Storytime",
    "slug": "kochu-nakshathrame",
    "yt_id": "CtsF20Kcp4I",
    "published": "2025-07-22",
    "duration": "PT5M40S",
    "lang": "ml",
    "categories": [
      "Story",
      "Family",
      "Folk"
    ],
    "description_short": "A bedtime story teaches constellations through Malayalam myths and songs.",
    "description_long": "Kochu Nakshathrame transforms the terrace into a planetarium where siblings map constellations with the help of a wise firefly. Each chapter introduces a Malayalam folk tale connected to Orion, Ursa Major, and the Milky Way. Animated chalk lines connect the stars as traditional sopana sangeetham chants swell in the background. The story highlights scientific curiosity by explaining how telescopes work, why stars twinkle, and how sailors navigated using the night sky. Kids learn to craft simple cardboard star wheels and practice mindful breathing while gazing upward. The script balances mythic wonder with STEM facts, encouraging families to plan a real stargazing night. The finale features a group sing-along inviting viewers to dedicate wishes to their own “kochu nakshathram,” strengthening emotional bonds before bedtime.",
    "tags": [
      "malayalam kids song",
      "malayalam rhymes for babies",
      "malayalam folk dance",
      "cartoon song malayalam short",
      "malayalam action song for kg students",
      "lkg nursery rhyme malayalam",
      "malayalam song school girl dance",
      "kerala kids rhyme",
      "ambambo kili",
      "malayalam animation 2025"
    ],
    "thumb_url": "https://img.youtube.com/vi/CtsF20Kcp4I/maxresdefault.jpg",
    "playlist_urls": [
      "https://www.youtube.com/watch?v=CtsF20Kcp4I"
    ],
    "end_screen_suggestions": [
      {
        "title": "Ambiliyammavaa",
        "slug": "ambiliyammavaa"
      },
      {
        "title": "Dolphin Birthday Song",
        "slug": "dolphin-birthday-song"
      }
    ]
  },
  {
    "title": "Veetumuttathe Praavukal | Village Courtyard Song",
    "slug": "veetumuttathe-praavukal",
    "yt_id": "s5DvXuPxj80",
    "published": "2025-08-30",
    "duration": "PT3M31S",
    "lang": "ml",
    "categories": [
      "Family",
      "Animals",
      "Village"
    ],
    "description_short": "Friendly doves guide kids through games and chores in a Kerala courtyard.",
    "description_long": "Veetumuttathe Praavukal sweeps into a sunny Kerala courtyard where doves coo directions for daily chores and playful games. The animated siblings wake up to broom the front yard, water jasmine creepers, and set up kolam art, all while singing in rhythmic Malayalam couplets. Each dove introduces a traditional game like kith-kith, spinning tops, or coconut shell bowling, ensuring fine motor practice and cooperative play. The track blends folk percussion with upbeat ukulele for a breezy village vibe. Cultural references to Onam floral carpets, plantain leaf snacks, and mango tree swings help urban kids connect with ancestral roots. Parents can use the video to teach responsibility, morning routines, and respect for animals that share the courtyard. The closing scene features a kite-flying challenge that encourages outdoor fun and healthy competition among friends.",
    "tags": [
      "malayalam kids song",
      "malayalam rhymes for babies",
      "malayalam folk dance",
      "cartoon song malayalam short",
      "malayalam action song for kg students",
      "lkg nursery rhyme malayalam",
      "malayalam song school girl dance",
      "kerala kids rhyme",
      "ambambo kili",
      "malayalam animation 2025"
    ],
    "thumb_url": "https://img.youtube.com/vi/s5DvXuPxj80/maxresdefault.jpg",
    "playlist_urls": [
      "https://www.youtube.com/watch?v=s5DvXuPxj80"
    ],
    "end_screen_suggestions": [
      {
        "title": "Pacha Thatha Paattu",
        "slug": "pacha-thatha-paattu"
      },
      {
        "title": "Koo Koo Theevandi",
        "slug": "koo-koo-theevandi"
      }
    ]
  },
  {
    "title": "Koo Koo Theevandi | Train Ride Rhythm",
    "slug": "koo-koo-theevandi",
    "yt_id": "DCA1DYbhA-M",
    "published": "2025-09-18",
    "duration": "PT4M45S",
    "lang": "ml",
    "categories": [
      "Story",
      "Dance",
      "Family"
    ],
    "description_short": "A rhythmic train journey teaches patterns, safety, and Malayalam beats.",
    "description_long": "Koo Koo Theevandi pumps energy into the living room with a musical train ride across Kerala landscapes. Children board the cartoon locomotive with Amma, learning platform manners, safety tips, and rhythmic clapping patterns that match the chugging wheels. Each compartment introduces a musical genre – folk, jazz, hip-hop, and classical – blending Malayalam lyrics with universal beats. Animated windows reveal paddy fields, coastal bridges, and bustling stations, sparking geography discussions. The chorus invites kids to practice stepping patterns perfect for school annual day performances. Mid-song puzzles challenge viewers to count coaches, identify shapes, and mimic conductor whistles. The finale features a “ticket to kindness” pledge encouraging children to help co-passengers, keep stations clean, and thank frontline workers. The infectious hook lingers, making it a favorite for road trips and classroom energizers.",
    "tags": [
      "malayalam kids song",
      "malayalam rhymes for babies",
      "malayalam folk dance",
      "cartoon song malayalam short",
      "malayalam action song for kg students",
      "lkg nursery rhyme malayalam",
      "malayalam song school girl dance",
      "kerala kids rhyme",
      "ambambo kili",
      "malayalam animation 2025"
    ],
    "thumb_url": "https://img.youtube.com/vi/DCA1DYbhA-M/maxresdefault.jpg",
    "playlist_urls": [
      "https://www.youtube.com/watch?v=DCA1DYbhA-M"
    ],
    "end_screen_suggestions": [
      {
        "title": "Pachakkari Song",
        "slug": "pachakkari-song"
      },
      {
        "title": "Dolphin Birthday Song",
        "slug": "dolphin-birthday-song"
      }
    ]
  },
  {
    "title": "Dolphin Birthday Song | Ocean Party Surprise",
    "slug": "dolphin-birthday-song",
    "yt_id": "GfM0cftOJ3k",
    "published": "2025-10-22",
    "duration": "PT3M50S",
    "lang": "ml",
    "categories": [
      "Animals",
      "Dance",
      "Family"
    ],
    "description_short": "Underwater friends plan a Malayalam birthday bash for a dancing dolphin.",
    "description_long": "Dolphin Birthday Song splashes into an underwater wonderland where mer-kids organize a surprise party for their dolphin buddy. Coral reefs shimmer like disco lights while Malayalam rap verses introduce ocean conservation facts. Each guest – a turtle DJ, a jellyfish percussionist, and a sardine choir – teaches hand movements resembling waves, bubbles, and coral sways. The storyline highlights teamwork as the crew bakes a seaweed cake, crafts biodegradable decorations, and practices mindful breathing before the surprise reveal. Interactive prompts encourage viewers to clap along, mimic aquatic movements, and shout birthday wishes in Malayalam. The bridge segment delivers easy science trivia about dolphin clicks and mangrove nurseries, making the party both educational and entertaining. The celebration wraps with a choreographed finale that invites kids to perform a water-inspired dance at their next birthday party, reinforcing messages of friendship and ocean stewardship.",
    "tags": [
      "malayalam kids song",
      "malayalam rhymes for babies",
      "malayalam folk dance",
      "cartoon song malayalam short",
      "malayalam action song for kg students",
      "lkg nursery rhyme malayalam",
      "malayalam song school girl dance",
      "kerala kids rhyme",
      "ambambo kili",
      "malayalam animation 2025"
    ],
    "thumb_url": "https://img.youtube.com/vi/GfM0cftOJ3k/maxresdefault.jpg",
    "playlist_urls": [
      "https://www.youtube.com/watch?v=GfM0cftOJ3k"
    ],
    "end_screen_suggestions": [
      {
        "title": "Onnanam Kochu Thumbi",
        "slug": "onnanam-kochu-thumbi"
      },
      {
        "title": "Koo Koo Theevandi",
        "slug": "koo-koo-theevandi"
      }
    ]
  }
]
